doc: added technical documentation update
